experiments/reverse/workload/job/test-script.yaml
# In Artillery, each VU will be assigned to one of the defined
# scenarios. By default, each scenario has a weight of 1, meaning
# each scenario has the same probability of getting assigned to a
# VU.
#
# By specifying a weight in a scenario, you'll increase the chances
# of Artillery assigning the scenario for a VU. The probability of
# a scenario getting chosen depends on the total weight for all
# scenarios.
#
# To learn more, read the Artillery documentation on scenario weights:
# https://artillery.io/docs/guides/guides/test-script-reference.html#Scenario-weights

config:
  target: "http://entry.{{ my_test_job_name }}:80"
  http:
    timeout: 30
  plugins:
    publish-metrics:
      - type: prometheus
        pushgateway: "http://prometheus-pushgateway.monitoring:9091"
        prefix: 'artillery_k8s'
        tags:
          - "load_test_id:{{ my_test_job_name }}"
          - "type:loadtest"
  phases:
    - duration: 10
      arrivalRate: {{ my_test_job_min_users }}
      name: Warm up
    - duration: 120
      arrivalRate: {{ my_test_job_min_users }}
      rampTo: {{ my_test_job_max_users }}
      name: Ramp up load
    - duration: {{ my_test_job_duration }}
      arrivalRate: {{ my_test_job_max_users }}
      name: Sustained load
scenarios:
  - name: "procedure"
    flow:
      - post:
          url: "/v0/demo"
          headers:
            maxcalls: '{{ my_test_job_max_calls }}'
            calls: '1'
            fanout: '{{ my_test_job_fanout }}'
          json:
            p1_v0: "{{ my_test_job_payload }}"
            p2_v0: "{{ my_test_job_payload }}"
            p3_v0: "{{ my_test_job_payload }}"
            p4_v0: "{{ my_test_job_payload }}"
            p5_v0: "{{ my_test_job_payload }}"